{"wordsWithTweets": [{"word": "racist", "bad_words_count": 75, "texts": ["#Trump is a racist scumbag and is all that's wrong in society https://t.co/g7v8Vb3SdG", "RT @hotelkeys: Trump is a racist. Stop this normalizing. https://t.co/MqFqvQs6xk", "@iceskaterhmb @gillianscarrie @chrissyteigen honey, trump is a racist so she's just stating facts", "@RoboticWizard @bob_wilkie @latimes Stop being civil. Trump is a racist who discriminates against non- whites, period", "daily reminder that donald trump is a racist asshole", "Trump is a racist. Stop this normalizing. https://t.co/MqFqvQs6xk", "RT @J_Rob1966: You are right! Trump is a racist! The first thing he does today is remove an African American family from government housing…", "@shernandez227 everyone who voted for trump is a racist. What a simple indeed fool you are.", "#Trump is a racist scumbag and is all that's wrong in society https://t.co/HRqVCkyKAW", "@PrisonPlanet are you really wondering why people think trump is a racist? I'm honestly curious, but either way the violence is 2much", "@971theticketxyt Turned on to listen for the first time since Jamie started bitching about trump.. \"Figer Law.. Trump is a racist!\" Turn off", "You are right! Trump is a racist! The first thing he does today is remove an African American family from government housing. #trumparound", "RT @kallywilli: @KeithOlbermann Yes, stupid Trump is a racist, purus! Besides, he owes Putin a lot of money dollars! Treason!", "@KeithOlbermann Yes, stupid Trump is a racist, purus! Besides, he owes Putin a lot of money dollars! Treason!", "#Trump is a racist scumbag and is all that's wrong in society https://t.co/geYM6zqn87", "@BenMaxton Trump is a racist bigot conman rapist narcissistic evil dangerous nut case misogynist loser...we as a ppl must protest", "On this, the eve of his inauguration, may we all remember that Donald Trump is a racist, a misogynist, a liar, and a loser. He will fail.", "@ezlusztig There is more public data proving Clinton is a rapist than Trump is a racist. Liberal lies and hypocrisy on display. Trump #MAGA", "Trump is a racist - proof \nToday he's gonna throw a black family out of their house😁😝", "TRUMP INAUGURATION: Finbarr attended a meeting for the protest. \"Trump is a racist and a sexist but the American people voted for him\"", "Americans and Brits are killjoy racists they call Obama the N word and say that Donald Trump is a racist its like pot calling kettle black.", "RT @Joan_of_Snarc: @feely_r @winsb45 @DenbrotS @AXSinVT @puppymnkey Yes, us American patriots are mad as hell that tRump is a racist Putin…", "#Trump is a racist scumbag and is all that's wrong in society https://t.co/P9HSnrc5Oc", "\"Screw Our President\" Trump is a racist ,sexual predator that is best buds with the despots of the world Putin,Duterte,Assad", "@DeplorableCathy Trump is a racist so why do you support him?", "Donald #Trump is a racist, misogynist, homophobic bigot who exploited people’s anger to fool them into voting for him. #Inauguration", "@LibertyB4Death Trump is a (Racist President) &amp; unfit to be president of America &amp; danger to the world he will start the third (Cold War)?", "@nickferrarilbc #Trump is a racist his business practices have shown", "@nickferrari_lbc #trump is a racist", "#Trump is a racist scumbag and is all that's wrong in society https://t.co/ootk4z9Q1Y", "Some people genuinely buy into the whole.. 'Trump is a racist, fascist, sexist, anti LGBTQ, Russian spy, modern day Hiltler'.. Hilarious! 😂", "@gatrosblake @djwonder @realdonaldtrump Hell no, trump is a racist dirtbag.", "@Descendants2fan @BarackObama @MichelleObama yeah me too. Trump is a Racist", "@CNN @ananavarro Trump is a racist what do you expect from him?", "RT @abctweet100: America Has Fallen. Trump is a Racist Buffoon Without the Intellect or Morals Needed to be President. A Boorish Fool Like…", "#Trump is a racist scumbag and is all that's wrong in society https://t.co/7SzBi3NZIa", "@AmandaSeyfried Amanda you really buy Trump is a racist, misogynist, etc... Have you REALLY looked at his positions??", "@AnnCoulter @TheHRH Skipping because Trump is a racist, misogynist, sexual predator...simply UNFIT to be Pres. Proving it more every day", "@kinni00 @terrymendozer Hold on... I was told by @johnlewis that Trump is a racist and all 'minorities' aka Americans are against him. hmm..", "Ain't that the truth Trump is a racist bastard https://t.co/BXGDZgtVVE", "Trump is a racist &amp; 6 other reasons he's not legit 2 be president-the world is horrified and has every reason to be  https://t.co/CWBZE444rY", "@ntagmn Trump is a Racist. He is going to introduce anti world policies to further show his racial discrimination. NIG should get ready.", "RT @Stevenwhirsch99: The media won't report much on this because it doesn't fit their \"Trump is a racist\" narrative. #MAGA https://t.co/Gn6…", "#Trump is a racist scumbag and is all that's wrong in society https://t.co/vLNh8JU4Yp", "@maxmichel1 \"omg Donald trump is a racist, bigot!!!!\" I'm so triggered and immature and have no sense of knowledge 😾😾😾😾😾😾😾😾😾😾😾😾😾😾😾😾😾😾😾😾😾😾😾😾😾", "@derekcarrqb Trump is a racist.", "If You Think Trump Is A Racist Please Prepare An Argument So I Can Destroy It And You!", "Donald Trump is a racist against everybody's believe even the vice president he is also a racism taking away women's rights", "RT @StopStopHillary: SO DEMOCRATS THIS KINDA BLOWS UR TRUMP IS A RACIST BIGOT OUT OF THE WATER EH?\n21 MILLION BIAFRANS ARE PRAYING FOR @rea…", "RT @sportsmediaLM: EXPLAIN how TRUMP IS A RACIST is the movement BEFORE the election and now all of that went BYE BYE \n\nNIGGERS u couldnt d…", "@alan_poirier @realDonaldTrump #Trump is a racist bigot who is fueling hatred for minorities and #WhitePrivelege and #WhiteNationalism", "@JimBrownNFL32  Sorry Mr. Brown but Trump is a racist, rapist. crook, thief, liar,corrupt, nasty, sexual predator who is not fit to be POTUS", "they are on to the NEXT STORY,, trump is a racist wont come up again until another 4 years for us to hoop and HOLLa https://t.co/FyAFS54WfB", "EXPLAIN how TRUMP IS A RACIST is the movement BEFORE the election and now all of that went BYE BYE \n\nNIGGERS u couldnt deliver", "#ThingsINoLongerBelieve @TheDemocrats are the good guys. Trump is a racist warmonger. CNN AND MSNBC are unbiased.", "#Trump is a racist scumbag and is all that's wrong in society https://t.co/yoGVqU9FFK", "@PatRyan1228 @Jordan7Florio and trump is a racist sexist pig", "RT @RiskyLiberal: #Inauguration #TrumpInauguration Donald Trump is a racist, bigoted, misogynistic incompetent grifter installed by Putin", "@silversprings24 @kiii3news yup trump is a racist pos tool", "@AlysiaStarnes @almostjingo @SteveAllwood Obama and Hillary spread this false narrative that Trump is a racist.Actually itS oBAMA WHO IS ONE", "RT @SportTaIkJoe: Liberals when you ask them to explain why they think Trump is a racist: https://t.co/kPP9kMagnL", "RT @gabeweisz_: Well trump is a racist so see how this argument doesn't work? https://t.co/Ycds7HwNhX", "#Trump is a racist scumbag and is all that's wrong in society https://t.co/w2uSWojQHA", "@Mike71471392 Not everyone that votes for Trump is a racist.", "@mishacollins @JordanJewcifer Trump is a racist, misogynistic, Xenophobic piece of scum. USA is already great thanks to #POTUS.", "@cristinalaila1 Of course he didn't, keep digging...why cant he find a single incident that PROVES TRUMP IS A RACIST? THERE ARENT ANY❤️💙🚂💨🇺🇸", "#Inauguration #TrumpInauguration Donald Trump is a racist, bigoted, misogynistic incompetent grifter installed by Putin", "@Anibanani2 @AC360 @ananavarro @CNN I honestly don't believe #Trump is a racist of any kind. I've seen no evidence that he is.", "#Trump is a racist scumbag and is all that's wrong in society https://t.co/ShqnXO2vAY", "@jonvoight OMG I didn't realize what a brainless A hole you are. We will be boycotting all your movies in future Trump is a racist &amp; sexist", "@ethan_taljonick oh shit yeah, didn't you here? Anyone who voted for trump is a racist.", "@Project_Veritas @lacymacauley What horrible ppl 2wanna inflict pain bcuz u claim Trump is a racist yet U spread HATE🙅", "RT @ronnin42: @AC360 @VanJones68 My son is who you are taking  about a Latino who is the qualified, amazing and brightest in his craft. Tru…", "@ArevFTW @DJMC25 @Phragle @mmceach476 @bosoxholic roses are red, Trump is a racist, sexist, xenophobe bigot and thanks just thanks white ppl", "RT @DebraWinters28: @SwaggyJay90 @AmyMek #forever44 ❤️❤️President Obama! The Best President ever! #Trumpistoxic Trump is a racist, sexual p…", "@BMajors80 meh. I keep saying go Pats, but if you feel like Trump is a racist I get it.", "@SnoopDogg . I am  black and I don't think Donald Trump is a racist. We blacks have failed to recognize our merchant ability.", "Trump is a racist, sexist, and basically all the -ist cause everyone knows it's true", "#Trump is a racist scumbag and is all that's wrong in society https://t.co/MR2YFXp9sW", "@AC360 @VanJones68 My son is who you are taking  about a Latino who is the qualified, amazing and brightest in his craft. Trump is a racist.", "RT @mericanViolence: People act like you slapped their mother when you say stuff like \"Trump is a racist\" \"Trump is childish\" \"Trump lies c…", "RT @imissMilfie: You know Donald Trump is a racist/sexist when he says \"Make America Great Again\" cause who has America been great to? Whit…", "Well trump is a racist so see how this argument doesn't work? https://t.co/Ycds7HwNhX", "@JoyyUnSpeakable Trump is a racist whiny baby i cant stand him"]}, {"word": "stupid", "bad_words_count": 75, "texts": ["@michaeltrillium Trump is a stupid infant whose every delusional action is dictated by profoundly desperate insecurity, &amp;you're saying this.", "Fill in the blanks. Donald J. Trump is a stupid ass ______.", "RT @Rubbishmael: \"HE'S NOT MY PRESIDENT.\"\n\nHe is you dumb motherfucker. Sure, Trump is a stupid piece of shit, but he's literally President.", "\"HE'S NOT MY PRESIDENT.\"\n\nHe is you dumb motherfucker. Sure, Trump is a stupid piece of shit, but he's literally President.", "@andrewkurtser @realDonaldTrump Trump is a stupid piece of crap.", "@FoxNews @realDonaldTrump \nI still think Trump is a stupid mo fo\nHope I'm wrong", "@carrieksada Don't even put them together.  Trump is a stupid, worthless bigoted piece of trash who hates America.", "@ktumulty @GlennKesslerWP @drlaurenawright Melania Trump is a stupid, eager, willing, plastic ornament. https://t.co/Cu8WnT8zWj", "Donald Trump is a stupid ass bitch 🖕🏽", "RT @AmyGallop66: Nah. Don't count on it. Trump is a stupid asshole. https://t.co/oBEgJgoZnv", "Nah. Don't count on it. Trump is a stupid asshole. https://t.co/oBEgJgoZnv", "@neena_sisson @paleblueeyes24 @RawlingsBob @Pamela_Moore13 you're talking about yourself. I feel sorry for you. Trump is a stupid conman.", "RT @Abu1916: Let me help you out with that David...Obama is a smart cunt, &amp; Trump is a stupid cunt... simples! https://t.co/Qateoyrx2y", "Let me help you out with that David...Obama is a smart cunt, &amp; Trump is a stupid cunt... simples! https://t.co/Qateoyrx2y", "@SnoopDogg Threatening people over Trump is a stupid Nigger move! Now when 1 gets hurt, they have YOUR CONFESSION A… https://t.co/YSAB4rJ3Wt", "donald trump is a stupid, stupid man. https://t.co/RjL2pM6Prs", "Trump is a stupid RUSSIAN", "@Eggkin @Indyria57Maria @StevenReyCristo @BetteMidler @AltFight So you think Trump is a stupid dog barking at a mailman? Got it!", "@ezraklein @voxdotcom TRUMP IS A STUPID SHITHEAD!!!", "Trump is a stupid insane dick \n#trumpisachump", "@thehill NO, We already know he will eff up this country along with the GOP. Trump is a stupid moron &amp; embarrassment to our country.", "RT @dcpetterson: Trump is a stupid, foolish, uneducated man with serious mommy issues, unfit to clean rest room floors. https://t.co/Axgle6…", "RT @Wooflepup: That Trump didn't have the basic sense not to go after John Lewis, and is still at it, proves Trump is a stupid, stupid man.", "Trump is a stupid, foolish, uneducated man with serious mommy issues, unfit to clean rest room floors. https://t.co/Axgle69Bgt", "John Lewis is a class act. Donald Trump is a stupid child. I pity him. Someone who has everything and has nothing.", "Trump is a stupid, racist turdstain. https://t.co/DZ7YNKIkvs", "@thehill Absolutely.  They were disgusting and lewd - two characteristics he has embraced.  Trump is a stupid, hateful cow!", "I'll say it man .... Donald Trump is a STUPID, ILLOGICAL, &amp; MISGUIDED Celebrity politician .. God bless America ...!", "What can I say? Trump is a stupid dick. He has the brain of a toad. @realDonaldTrump https://t.co/R3Y1HGrRqt", "I think it's important to not lose sight of the fact that Donald Trump is a stupid fucking name. https://t.co/a8PwPLPcy7", "That Trump didn't have the basic sense not to go after John Lewis, and is still at it, proves Trump is a stupid, stupid man.", "@ABC @realDonaldTrump Trump is a stupid bitch....", "@realjoshmcd @Liz_Wheeler @OANN @realDonaldTrump But Trump is a stupid man in power and that is disastrous.", "Trump is a stupid ass, ignorant,fat ass man who kept dodging the war back in the day. What have you done except talk shit &amp; not pay taxes.", "trump is a stupid f**kr...at best https://t.co/UPXoAgQUP8", "@kurteichenwald @DeontrezAlbury Easy answer..TRUMP is a STUPID man!!!", "@FoxNews @realDonaldTrump @repjohnlewis  Trump is a stupid disrespectful bully at 70 years old. Heart attack or stroke? Mental evaluation?", "Why in the FUCK would you trade a trade war with your neighboring countries? Trump is a stupid motherfucker.", "RT @RiskyLiberal: Donald Trump is a stupid, gullible, incompetent puppet, who endangers America with his words and actions https://t.co/uyh…", "Donald Trump is a stupid, gullible, incompetent puppet, who endangers America with his words and actions https://t.co/uyhH0LMnPf", "@politico Anybody with a brain knows Trump is a stupid baby.", "@Sargon_of_Akkad @jack Trump is a stupid dickhead who should've been aborted, but he's our stupid dickhead who should've been aborted", "Like that is so sad and so fucking scary again let me say every one of y'all who voted for trump is a stupid, stupid piece of human shit", "Trump is a stupid, spoiled little rich baby! Who, if he can't get his own way, cries like a baby. Boo hoo, boo hoo.", "Trump is a stupid crook !!! https://t.co/ttV1xBhnUE", "RT @salvadormom: @Shizzletheland @AdamWeinstein.Hillary was a deeply flawed candidate.Trump is a stupid man used by Russians; his ego will…", "@Shizzletheland @AdamWeinstein.Hillary was a deeply flawed candidate.Trump is a stupid man used by Russians; his ego will be downfall", "RT @MariaMi1962: @CNN @landmgarcia67 @Acosta Trump is a stupid idiot!!!", "@NR_Garrett @stevesilberman @FoxNews Donald Trump is a stupid person's idea of what a smart businessman looks like.", "@CNN @landmgarcia67 @Acosta Trump is a stupid idiot!!!", "@fjm1947 you just admitted Trump is a stupid lying, low life, dumbass. @morrigan785 @Trues55 @ericgeller @TheWrap", "#Trump is a stupid ass and not MY president", "What he did when mocking the reporter was stupid. DJT didn't do because of the journalist's disability, but because Trump is a stupid guy.", "@KathleenAMoore TRUMP IS A STUPID RACIST IDIOT THAT HAS NO BUSINESS BEING IN THE WHITE HOUSE", "@TheFreshBrew @realDonaldTrump Nixon was not a buffoon &amp; was very intelligent. Trump is a stupid buffoon.", "Jackass Trump is a stupid fool!", "Donald J. Trump Is a stupid ass man.  Str8 up https://t.co/1Tv7yegCsg", "RT @BeeHambone: @_Ungagged Nixon wasn't 'embarrassing'. He was a clever, dangerous psychopath. Trump is a stupid, dangerous narcissist . I'…", "@CNN @Acosta trump is a stupid clown", "@_Ungagged Nixon wasn't 'embarrassing'. He was a clever, dangerous psychopath. Trump is a stupid, dangerous narcissist . I'd say the...", "@CNN trump is a stupid piece of $hit - I wouldn't be too upset if I were you - consider the source!", "@ABC trump is a stupid man", "@CBSNews trump is a stupid stupid man", "@NBCNews trump is a stupid man", "Donald trump is a stupid piece of shit but I'm surprised at JUST how awful this press conference is...someone missed firc speech lol", "Everyone who voted for trump is a stupid asshole. Yeah, I said that!😩", "#TrumpPressConference\nWhat a banana!\n[Hope bananas don't feel insulted]\nTrump is a stupid bore\nSad time for USA", "Donald Trump is a stupid old man who should be easing into retirement and sexually harassing his nurse, not running the United States", "In my opinion,Donald Trump is a stupid.He has no ideas in politics", "@Vallmeister And that may have been the long term goal. Trump is a stupid egomaniac puppet!", "@GMA @KellyannePolls Trump is a stupid enough candidate to be compromised... BTW Kelly your credibility sucks.....", "@Scenpaii trump is a stupid. that's why people hate him lol"]}, {"word": "idiot", "bad_words_count": 55, "texts": ["@realDonaldTrump I wish Clinton won anyways, Trump is a Idiot", "RT @bluezlimit: Donald Trump is a idiot. A damn embarrassing mess for America.", "RT @bigkay4527: Trump is a idiot he isn't answering the questions.  He goes around the questions and never gives direct answers.", "@realDonaldTrump  Trump is a idiot.", "@RogerJStoneJr @realDonaldTrump @RealAlexJones @infowars @PrisonPlanet Trump is a idiot mouse white DUMB !", "RT @karljr87: Donald trump is a idiot he is making fun of blackish, he said what if the show call whitish thats racists to him", "@RyanACarrillo @PhilQueensNY @realDonaldTrump cuz it'sbetter to say they trump is a idiot douche bag liar and crook. Much nicer to say dummy", "@TheRickyDavila  no president  Obama  showed intelligence  trump is  a idiot", "@ThereseLawren16 @realDonaldTrump I feel sorry 4 all americans. The world laughs at you...really. #Trump is a… https://t.co/7MfuocPQ2O", "@ItsAlexOkay_ Trump is a idiot\nWe are all screwed", "RT @Christo59390079: Trump is a idiot and traitor, and does not seem to care. @realhinglec @glennbeck @jemag1 @ckkoch3", "Trump is a idiot and traitor, and does not seem to care. @realhinglec @glennbeck @jemag1 @ckkoch3", "Because Trump is a idiot ! The hepatitis is affecting his brain !!! https://t.co/Q4iRQnKDl8", "RT @wiljune1966: @FoxNews @foxnewspolitics @AdamShawNY Donald Trump is a Idiot. It's ok the World knows", "@FoxNews @foxnewspolitics @AdamShawNY Donald Trump is a Idiot. It's ok the World knows", "Trump is a idiot.⚡️ “Trump and Russia say NATO is obsolete”\n\nhttps://t.co/uBqIYnrC6E", "Donald trump is A Idiot. Freedom of speech!!!", "@hillrod17 What do you expect Donald Trump is a idiot.", "@fowler2_johnm you knew better and decided against your moral compass. Trump is a idiot, I expected more from the people like yourself.", "RT @yankee32x: I think Donald Trump is a idiot", "@reaIDonaIdTfump @tonyposnanski @bandmanli Donald Trump is a Idiot. Enough said", "Trump is a idiot talking to idiots,he'll say anything because they'll believe anything https://t.co/8fhojLnorX", "Like I mean trump is a idiot, sexist , racist, disgusting human and half of America is terrible for voting for him", "@Chiefsfan007 @realDonaldTrump @NBCNews Sorry buddy but trump is a idiot let his cabinet lead cause he is no leader", "RT @si1971brown: @Nigel_Farage @realDonaldTrump Donald trump is a idiot like u fag smoking beer swilling prat u shud look closer too home.…", "@Nigel_Farage @realDonaldTrump Donald trump is a idiot like u fag smoking beer swilling prat u shud look closer too… https://t.co/O6kqeXFwSS", "@FoxNews @toddstarnes Donald Trump is a Idiot. Enough said", "@PoliticsNewz lol he will 4 sure Trump is a idiot moron Wannabe Dictator scum sucking bastard piece of shit @FoxNews @realDonaldTrump @MSNBC", "Trump is a IDIOT! Trump: Lewis should help me work on inner cities https://t.co/ACzZGQmY6o", "Trump is a idiot with no class @  all", "@MiaFarrow trump is a idiot", "@realDonaldTrump @OANN Judy- you look like a woman who has been disappointed by men before, so it shouldn't be a shock that Trump is a idiot", "Trump doesn't know the history behind john lewis, if he did he wouldn't have said that.. Lmao trump is a idiot", "@El__Chorro Because Trump is a idiot that doesn't know when to shut up and be Presidential", "Wth? Lewis is a patriot.\nTrump is a idiot. https://t.co/JCOmTTPzR8", "@ThirdCross777 @Bamanboi hillary is a war loving cunt and trump is a idiot borderline racist", "Failed party ?.You are a prime example of Trailer Trash Trumptard. Trump is a idiot, condescending asshole. What wi… https://t.co/QnaqBZICE8", "RT @TheRealDevonA: @jimsciutto @samswey @Acosta @seanspicer wow!! Trump is a idiot. And @seanspicer is a puppet and a idiot for threatening…", "RT @wiljune1966: @ForeignAffairs Donald Trump is a Idiot and it showing its Head", "@ForeignAffairs Donald Trump is a Idiot and it showing its Head", "@CNN WELL TRUMP IS A IDIOT! SO ANY HELP CAN HELP.. I GUESS https://t.co/UtZEs6OpRn", "@mskristinawong trump is a idiot", "I think Donald Trump is a idiot", "@repmarkpocan @bpshow Trump is a idiot", "TRUMP IS A IDIOT ...NO EXPERIENCE TO TALK  NO CLASS https://t.co/SHD5oeh9DQ", "@cherry1776tree @jimmyfallon @FLOTUS. I'm sure he will .Trump is a idiot", "@OutFrontCNN @Acosta @ErinBurnett @CNN \n\nTrump is a idiot he is rude....   Has money no class just trashy    He is ugly", "@Codi6934268 @RickysTx1 @ClassicalDemo2 @FoxNews Never trust Donald Trump is a Idiot", "Can we all agree that Trump is a idiot?", "Trump is a idiot", "RT @_XoxoCourt: Donald Trump is a idiot. He's really about to try and build this wall with our tax dollars then claim Mexico gonna pay us b…", "Donald Trump is a idiot. He's really about to try and build this wall with our tax dollars then claim Mexico gonna pay us back...", "@TheTodayShow \nTrump is a idiot  dont rate him much as next president?", "@jimsciutto @samswey @Acosta @seanspicer wow!! Trump is a idiot. And @seanspicer is a puppet and a idiot for threatening freedom of speech", "RT @LML1974: Friends Donald Trump Is A Idiot Today's Press conference Horrible 4 Years of Hell Ahead Friends SMH!!!!!😂😂", "@Shan3671 @VicenteFoxQue so we are going to piss off the world except for Russia, Trump is a idiot, his followers are clueless", "Friends Donald Trump Is A Idiot Today's Press conference Horrible 4 Years of Hell Ahead Friends SMH!!!!!😂😂", "Donald trump is a idiot... that press conference was shambles. All he does is bicker... not professional at all", "@Zadi more ap0les,and rotten tomates Trump is a idiot,and he is going lay waste to this country", "@THR ROFLMAO..TRUMP IS A IDIOT WHO CNT KEEP HIS MOUTH SHUT..WHT A JOKE..", "RT @GlennFromMason: OMG....America elected a real live BEVERLY HILLBILLY. Donald Trump is a idiot. I'm so proud I voted for Obama.Trump is…", "OMG....America elected a real live BEVERLY HILLBILLY. Donald Trump is a idiot. I'm so proud I voted for Obama.Trump is a FOOL #Embarrassing", "trump is a idiot no tax returns no responsibilities for his outright lies we teach are children to not do everything he does he is a child", "@FoxNews @realDonaldTrump Who Cares. Donald Trump is a Idiot", "@simonhedlin @realDonaldTrump My first day here in Germany, and my German Taxi driver said Donald Trump is a idiot..how embarrassing it was", "@chelseahandler Trump is a idiot", "@realDonaldTrump @CNBC trump is a idiot", "@BigOMitchell @fishsports well trump is a idiot so idk why he has to stick to football", "@Pamela_Moore13 bc he knows trump is a idiot."]}, {"word": "corrupt", "bad_words_count": 49, "texts": ["RT @igob4u2: Trump is a Corrupt #illegitimatePeotus RT #LockHimUp\nU.S. Task Force Seeking To Link Kremlin $$$ To Trump Campaign https://t.c…", "Azz, because Hillary is Not corrupt. Trump is a corrupt, thin skinned, a con, he's commuted Treason &amp; history will… https://t.co/3izPfVgSsH", "What kind of crap are you spouting? Trump is a corrupt, slimy, creepy sexual deviant who did not win legitimately.… https://t.co/2XMPZL1ESi", "Trump is a Corrupt #illegitimatePeotus RT #LockHimUp\nU.S. Task Force Seeking To Link Kremlin $$$ To Trump Campaign https://t.co/HWeeH7Z5Q2", "It gets really old. Trump is a corrupt, sniveling thief, getting away with everything for a moment in time....but j… https://t.co/sriIHU8gvi", "Donald Trump is a corrupt loser who breaks his promises. https://t.co/PfXa0cHSnc", "@MarkDice your president Trump is a corrupt president has put people who are corrupt in the White House", "It's a time for unity; no candidate is perfect, sure Trump is a corrupt, racist, wife-beating rapist, but Barack Obama was born in Hawaii.", "Reminder: Trump is a corrupt omnibigoted sexual predator and liar who plans more crimes and who lost the popular vo… https://t.co/14hQygVNVG", "@thetoy1123 @KGBVeteran @NewtAgain @ReturnOfWeezer @lonepatrick trump is a corrupt scumbag!", "@bobkarleysimon @AnaisNincompoop @pittgriffin @draginol @robertmclaws FACT: Donald Trump is a corrupt loser who breaks his promises.", "RT @michael_w_busch: Reminder: Trump is a corrupt omnibigoted sexual predator and liar who plans more crimes and who lost the popular vote…", "@LOLGOP Yeah, we're all united in thinking Trump is a corrupt orange douchenozzle.", "RT @abctweet100: Trump is a Corrupt Con who has succeeded bc of Souless ENABLERS #TrumpKids #GOP #TrumpFools #Republicans #Media #Law https…", "Retweeted Michael Busch (@michael_w_busch):\n\nReminder: Trump is a corrupt omnibigoted sexual predator and liar... https://t.co/8Nizr7rl3L", "RT @WYVeteran: FASCIST TRUMP is a corrupt PIG! #kenosha #janesville #madison #milwaukee #erie https://t.co/YwXcshdCoC", "Reminder: Trump is a corrupt omnibigoted sexual predator and liar who plans more crimes and who lost the popular vote by &gt;2,860,000 votes.", "FASCIST TRUMP is a corrupt PIG! #kenosha #janesville #madison #milwaukee #erie https://t.co/YwXcshdCoC", "@james_black81 And yet, none in the field she's aiming for. She's just another piece of evidence that Trump is a corrupt traitor.", "RT @onlinePperson: @wheredabrewsat @nicktjacob trump is a corrupt Russian mafia puppet whose talents are self promotion, snake oil salesman…", "@TheView Trump is planning Hitler takeover Paul Ryan is evil; Comey is corrupt, anyone with Trump is a corrupt, abusive, evil idiot!", "Trump is a Corrupt Con who has succeeded bc of Souless ENABLERS #TrumpKids #GOP #TrumpFools #Republicans #Media #Law https://t.co/0In3Oc4CQ0", "@wheredabrewsat @nicktjacob trump is a corrupt Russian mafia puppet whose talents are self promotion, snake oil salesman and pussy grabbing", "@AdrianAmherst @FoxNews @seanhannity Couldn't care less about Clinton. Think Trump is a corrupt idiot.", "Reminder: Trump is a corrupt omnibigoted sexual predator and liar who plans more crimes and who lost the popular vo… https://t.co/zaBnX7mis8", "RT @michael_w_busch: Me: \"Trump is a corrupt omnibigoted sexual predator and liar\"\n\nTrump supporters: \"[ sexist slurs ]\",  \"[ racist slurs…", "@marklevinshow Hate your show. You are a hate propagandist. Hypocrite. Trump is a corrupt crazy incompetent racist bafoon. Speak truth", "Me: \"Trump is a corrupt omnibigoted sexual predator and liar\"\n\nTrump supporters: \"[ sexist slurs ]\",  \"[ racist slurs ]\".\n\nSo. Yeah.", "RT @mariecasey1: @cmikey01 @mmpadellan Trump is a corrupt moron, GOP will have to dump his ass sooner rather than later or go down with him.", "@cmikey01 @mmpadellan Trump is a corrupt moron, GOP will have to dump his ass sooner rather than later or go down with him.", "@cnnbrk You rock!!!! We not in vain believed in you!!! You rock!!!! Trump is a corrupt bastard! The electric chair waiting for a customer!!!", "@daniel17643 @Kalnory You seriously don't think Trump is a corrupt draft dodging puppet?", "Trump is a corrupt Criminal connected to the historic organised crime that has had gangsters and violent... https://t.co/FxeEmCrjRX", "Holy fuck, what does it take to know Trump is a corrupt flim flam man? Not like why haven't seen him operate over t… https://t.co/lE1Yx1yWFE", "Trump is a corrupt piece of shit who nominates other corrupt pieces of shit for positions in his government. https://t.co/Oa8hElEYl2", "@prof_gabriele I want Dems to say - trump is a corrupt fascist and resist EVERYTHING. Is that the right move to win?", "“Trump moves forward with a foreign deal less than a week after vowing not to” by @ngeiling https://t.co/jELryXJaow\n\nTrump is a corrupt liar", "@JohnRenown so you agree. Trump is a corrupt criminal ? You just didn't realize till after you voted for him?", "@OutLawX71 @Lordcaston @ALT_RIGHT_UK @mannyfidel Trump is a corrupt con man. America deserves far better.", "#Trump is a #corrupt, #minorityPresident, who's #betrayed his country. #DontheCon.  \nhttps://t.co/i6t8tqSmH7 via @georgelakoff", "RT @larris16: Who needs evidence to understand Trump is a corrupt piss loving pig. https://t.co/tkNORqasKl", "@DiegoAleEsco @MMFlint Trump is not a legitimate president.  Elected by Russian interference Trump is a corrupt loser - not our president!", "RT @Coco_Wms: Trump is a corrupt demagogue who has already used his new found political power to make money for himself /cronies. \nhttps://…", "Trump is a corrupt demagogue who has already used his new found political power to make money for himself /cronies. \nhttps://t.co/jPY3kjwaal", "Who needs evidence to understand Trump is a corrupt piss loving pig. https://t.co/tkNORqasKl", "RT @GailRNJD: @davidaxelrod @repjohnlewis Trump is a corrupt, vicious and despicable man. I agree w John Lewis. There's nothing to honor in…", "@TheRevolutionII When calling someone else dumb you should really use spell check. Trump is a corrupt liar.", "@Mercurian1139 @purestar777 @ltgins @realDonaldTrump Believe what? That Trump is a corrupt bully led by a brainwash… https://t.co/mC3qKAyG68", "@Reenhogan @kayleighmcenany @thehill I am a Rep. DT isn't. Trump is a corrupt, bought &amp; paid for Russian hack. 18 months, tops!"]}, {"word": "misogynist", "bad_words_count": 46, "texts": ["When a protester flashes her boobs… And says Trump is a misogynist… All I can think of is how I haven't gotten any in awhile! #WeStandUnited", "Donald Trump is a misogynist", "@GirlScouts shouldn't be part of inauguration. tRump is a misogynist, sends bad msg to girls everywhere.", "@Erik_Verduzco Trump is a misogynist? His campaign manager is a woman.", "@realDonaldTrump \"Donald Trump is a misogynist, bigoted, racist, classist asshat.\"  Today, as stated by me. #notmypresident", "@AllisonNielsen \"Trump is a misogynist! Let's attack women at his inauguration to show them what a creep he is!\" 🤔", "@Felix49750436 @nuclearman515 @mreppn I do not. Believe in conservative principles? Great! Trump is a misogynist, and he isn't conservative.", "@VoteSmarts you lose dummy. Trump is a misogynist sexist racist birther. Geez!\n @KissMyAmFlag", "@CrabbyVince @ShonHarris9 @TijlDeclerck \n\nIf truth were a sport\n@CrabbyVince \nYou would be a loser\nTrump is a\nMisogynist \nTruth not liberal", "@girlscouts I am so disappointed that you will be a part of the Inauguration.  Trump is a misogynist and is against women's rights.", "@AboveAverageA  Question: do you think Donald Trump is a misogynist or just a carefree male?", "RT @Thalia_Nyx: @KMontyofCal @reaIDonaIdTfump @criticalthinkrs @denisedavis1976 @TRafaelCimino @realDonaldTrump  Trump is a rapist, Trump i…", "So much for my 5 year old daughter joining the @girlscouts. Normalizing Trump is not ok. Trump is a misogynist. #Shameful #NotMyGirlScouts", "@dochvactech1 @tjinaustin01 @MTV @MileyCyrus &amp; MEGYN K SAYS TRUMP IS A MISOGYNIST WHO CALLS WOMEN BIMBO\n🤣 https://t.co/9W9Yk7hu8Y", "Grandma doesn't believe Trump is a misogynist \n\nEven though he's caught on tape\n\nSaying he can do anything he wants to women \n\nLol", "@KMontyofCal @reaIDonaIdTfump @criticalthinkrs @denisedavis1976 @TRafaelCimino @realDonaldTrump  Trump is a rapist, Trump is a misogynist", "@IlladelphAC @sarahmccammon Trump is a misogynist, racist, xenophobe. Didn't need a journo 2 literally tell me that when shown examples.", "RT @shelbyeezus: maybe if we looked past just political views and realize that trump is a misogynist racist demon and shouldn't be normaliz…", "maybe if we looked past just political views and realize that trump is a misogynist racist demon and shouldn't be normalized", "Trump sued for defamation by former Apprentice Summer Zervos: Former Apprentice contestant says Donald Trump is a \"… https://t.co/j2FaBGOFaP", "So y'all gone just have the lil girl scouts go to this inaug parade knowin that Trump is a misogynist AND highkey a predator? Mk", "Former Apprentice contestant says Donald Trump is a \"misogynist\" who \"debased and denigrated\" her. https://t.co/YuOKxifwu4", "Former Apprentice contestant says Donald Trump is a \"misogynist\" who \"debased and denigrated\" her.", "Former Apprentice contestant says Donald Trump is a “misogynist” who “debased and denigrated” her. https://t.co/O17LKhGkAE", "A young, dumb blonde who doesn't understand Trump is a misogynist who wld like to do ONE THING to her, so bend over if u r game, honey.", "@ngonimaurice No. Because she was more qualified.\nAnd Trump is a misogynist.", "RT @BrokenCountry1: Donald Trump is Racist! Donald Trump has tiny hands. Donald Trump is a misogynist!  Here's your alternative. #HillaryCl…", "@TuckerCarlson your interview with @Jehmu was comical. Simple questions asking her opinion turned to race and trump is a misogynist/ racist.", "@fishergirlusmc Deflection! Donald Trump is a misogynist, racist, traitor . .", "@repmarkpocan @ShaunKing @realDonaldTrump @repjohnlewis How about instead not go because Trump is a misogynist, racist &amp; homophobe.", "These women saw what they wanted to see. Trump is a misogynist who brags about sexually assaulting women. That's it\n\nhttps://t.co/0W05ZhFHPY", "Donald Trump is Racist! Donald Trump has tiny hands. Donald Trump is a misogynist!  Here's your alternative.… https://t.co/B12kw44CTj", "@atticsonline @A_J_Richards222 @hayleyyjay @shelbeeray its not like trump is a misogynist , sexist , racist piece of shit and his+", "@Rockettes Donald Trump is a misogynist, sexist &amp; racist.  Shame on any woman supporting him.", "@jackieevancho  Donald Trump is a misogynist &amp; sexist. I am sorry, I cannot support an artist that supports him.", "@Stevenwhirsch99 But Trump is a misogynist???", "And the world wonders why #Trump is a #misogynist... #woolf #amreading https://t.co/K5cOZWKbZH", "RT @WendySunshine1: @RefuseFascism @Rosie @Cookiemuffen Trump is a misogynist creep, but worse than that he is a sexual predator and pedoph…", "RT @cmurray862: @BlissTabitha Bill Clinton bangs interns, rapes associates and feels up anything near him and Trump is a misogynist? Elliso…", "@RefuseFascism @Rosie @Cookiemuffen Trump is a misogynist creep, but worse than that he is a sexual predator and pedophile. Register him.", "#LIberalLogic \"#Trump is a misogynist!!!!\" (Support  Bill Clinton, Anthony Weiner, Al Gore, Cory Booker Etc)\nMe:\nhttps://t.co/Tww8lzabLz", "@BlissTabitha Bill Clinton bangs interns, rapes associates and feels up anything near him and Trump is a misogynist? Ellison is very bright!", "Ignore all the snowflakes who get triggered whenever you show them evidence that Trump is a misogynist  #RulesforWomensMarch", "@WSJ Let's see: Trump is a misogynist because of womanizing, but adored Democrat champion womanizers, JFK and Bill Clinton, were not.", "@_Makada_ What is wrong with you? I hope this account is a joke. TRUMP is a misogynist and loves to defile women with words. YOU R A WOMAN!", "RT @polblonde: Trump is a misogynist who boasted about groping women. No idea if it exists, but would a tape showing him with prostitutes t…", "@TobyKeithMusic Please don't play at Trump's inauguration. I love your music but you are showing you dont care Trump is a misogynist", "Liberal logic\nIn robotic voice \nTrump Is a racist \nTrump is a misogynist\nTrump Is xenophobic\nRepeat descriptions for any person not Liberal", "@jonathanchait I would just thank everyone who showed up. Trump is a misogynist fuck, so a women's march seams right.", "Trump is a misogynist who boasted about groping women. No idea if it exists, but would a tape showing him with prostitutes trouble his fans?"]}], "mostUsedWord": "LIAR", "celeb_details": {"image": "http://pbs.twimg.com/profile_images/1980294624/DJT_Headshot_V2.jpg", "twitter_name": "realDonaldTrump", "name": "Donald J. Trump"}}