{
	"wordsWithTweets": [{
			"word": "stupid",
			"texts": [
				"RT @djonesie12: trump is A STUPID " OLD " BULLY, the clock is ticking 4 #hitlercon-huckstertrump??...this??RACIST??INVECTIVE will be impeached????…",
				"RT @djonesie12: @thehill @amjoyshow trump is A STUPID " OLD " BULLY, the clock is ticking 4 #hitlercon-huckstertrump??,this??RACIST??INVECTIVE w…",
				"RT @AmyGallop66: Nah. Don't count on it. Trump is a stupid asshole. https://t.co/oBEgJgoZnv",
				"Nah. Don't count on it. Trump is a stupid asshole. https://t.co/oBEgJgoZnv",
				"@neena_sisson @paleblueeyes24 @RawlingsBob @Pamela_Moore13 you're talking about yourself. I feel sorry for you. Trump is a stupid conman.",
				"RT @Abu1916: Let me help you out with that David...Obama is a smart cunt, &amp; Trump is a stupid cunt... simples! https://t.co/Qateoyrx2y",
				"Let me help you out with that David...Obama is a smart cunt, &amp; Trump is a stupid cunt... simples! https://t.co/Qateoyrx2y",
				"@SnoopDogg Threatening people over Trump is a stupid Nigger move! Now when 1 gets hurt, they have YOUR CONFESSION A… https://t.co/YSAB4rJ3Wt",
				"donald trump is a stupid, stupid man. https://t.co/RjL2pM6Prs",
				"Trump is a stupid RUSSIAN",
				"@Eggkin @Indyria57Maria @StevenReyCristo @BetteMidler @AltFight So you think Trump is a stupid dog barking at a mailman? Got it!",
				"@ezraklein @voxdotcom TRUMP IS A STUPID SHITHEAD!!!",
				"Trump is a stupid insane dick #trumpisachump",
				"@thehill NO, We already know he will eff up this country along with the GOP. Trump is a stupid moron &amp; embarrassment to our country.",
				"RT @dcpetterson: Trump is a stupid, foolish, uneducated man with serious mommy issues, unfit to clean rest room floors. https://t.co/Axgle6…",
				"RT @Wooflepup: That Trump didn't have the basic sense not to go after John Lewis, and is still at it, proves Trump is a stupid, stupid man.",
				"Trump is a stupid, foolish, uneducated man with serious mommy issues, unfit to clean rest room floors. https://t.co/Axgle69Bgt",
				"John Lewis is a class act. Donald Trump is a stupid child. I pity him. Someone who has everything and has nothing.",
				"Trump is a stupid, racist turdstain. https://t.co/DZ7YNKIkvs",
				"@thehill Absolutely. They were disgusting and lewd - two characteristics he has embraced. Trump is a stupid, hateful cow!",
				"I'll say it man .... Donald Trump is a STUPID, ILLOGICAL, &amp; MISGUIDED Celebrity politician .. God bless America ...!",
				"What can I say? Trump is a stupid dick. He has the brain of a toad. @realDonaldTrump https://t.co/R3Y1HGrRqt",
				"I think it's important to not lose sight of the fact that Donald Trump is a stupid fucking name. https://t.co/a8PwPLPcy7",
				"That Trump didn't have the basic sense not to go after John Lewis, and is still at it, proves Trump is a stupid, stupid man.",
				"@ABC @realDonaldTrump Trump is a stupid bitch....",
				"@realjoshmcd @Liz_Wheeler @OANN @realDonaldTrump But Trump is a stupid man in power and that is disastrous.",
				"Trump is a stupid ass, ignorant,fat ass man who kept dodging the war back in the day. What have you done except talk shit &amp; not pay taxes.",
				"trump is a stupid f**kr...at best https://t.co/UPXoAgQUP8",
				"@kurteichenwald @DeontrezAlbury Easy answer..TRUMP is a STUPID man!!!",
				"@FoxNews @realDonaldTrump @repjohnlewis Trump is a stupid disrespectful bully at 70 years old. Heart attack or stroke? Mental evaluation?",
				"Why in the FUCK would you trade a trade war with your neighboring countries? Trump is a stupid motherfucker.",
				"@thehill @amjoyshow trump is A STUPID " OLD " BULLY, the clock is ticking 4 #hitlercon-huckstertrump??,this??RACIST??INVECTIVE will be impeached??",
				"@amjoyshow @MSNBC trump is A STUPID " OLD " BULLY, the clock is ticking 4 #hitlercon-huckstertrump??, this??RACIST??INVECTIVE will be impeached????",
				"trump is A STUPID " OLD " BULLY, the clock is ticking 4 #hitlercon-huckstertrump??...this??RACIST??INVECTIVE will be imp… https://t.co/CaAJhUfpfO",
				"RT @RiskyLiberal: Donald Trump is a stupid, gullible, incompetent puppet, who endangers America with his words and actions https://t.co/uyh…",
				"Donald Trump is a stupid, gullible, incompetent puppet, who endangers America with his words and actions https://t.co/uyhH0LMnPf",
				"@politico Anybody with a brain knows Trump is a stupid baby.",
				"@Sargon_of_Akkad @jack Trump is a stupid dickhead who should've been aborted, but he's our stupid dickhead who should've been aborted",
				"Like that is so sad and so fucking scary again let me say every one of y'all who voted for trump is a stupid, stupid piece of human shit",
				"Trump is a stupid, spoiled little rich baby! Who, if he can't get his own way, cries like a baby. Boo hoo, boo hoo.",
				"Trump is a stupid crook !!! https://t.co/ttV1xBhnUE",
				"RT @salvadormom: @Shizzletheland @AdamWeinstein.Hillary was a deeply flawed candidate.Trump is a stupid man used by Russians; his ego will…",
				"@Shizzletheland @AdamWeinstein.Hillary was a deeply flawed candidate.Trump is a stupid man used by Russians; his ego will be downfall",
				"RT @MariaMi1962: @CNN @landmgarcia67 @Acosta Trump is a stupid idiot!!!",
				"@NR_Garrett @stevesilberman @FoxNews Donald Trump is a stupid person's idea of what a smart businessman looks like.",
				"@CNN @landmgarcia67 @Acosta Trump is a stupid idiot!!!",
				"@fjm1947 you just admitted Trump is a stupid lying, low life, dumbass. @morrigan785 @Trues55 @ericgeller @TheWrap",
				"#Trump is a stupid ass and not MY president",
				"What he did when mocking the reporter was stupid. DJT didn't do because of the journalist's disability, but because Trump is a stupid guy.",
				"@KathleenAMoore TRUMP IS A STUPID RACIST IDIOT THAT HAS NO BUSINESS BEING IN THE WHITE HOUSE",
				"@TheFreshBrew @realDonaldTrump Nixon was not a buffoon &amp; was very intelligent. Trump is a stupid buffoon.",
				"Jackass Trump is a stupid fool!",
				"Donald J. Trump Is a stupid ass man. Str8 up https://t.co/1Tv7yegCsg",
				"RT @BeeHambone: @_Ungagged Nixon wasn't 'embarrassing'. He was a clever, dangerous psychopath. Trump is a stupid, dangerous narcissist . I'…",
				"@CNN @Acosta trump is a stupid clown",
				"@_Ungagged Nixon wasn't 'embarrassing'. He was a clever, dangerous psychopath. Trump is a stupid, dangerous narcissist . I'd say the...",
				"@CNN trump is a stupid piece of $hit - I wouldn't be too upset if I were you - consider the source!",
				"@ABC trump is a stupid man",
				"@CBSNews trump is a stupid stupid man",
				"@NBCNews trump is a stupid man",
				"Donald trump is a stupid piece of shit but I'm surprised at JUST how awful this press conference is...someone missed firc speech lol",
				"Everyone who voted for trump is a stupid asshole. Yeah, I said that!??",
				"#TrumpPressConference What a banana! [Hope bananas don't feel insulted] Trump is a stupid bore Sad time for USA",
				"Donald Trump is a stupid old man who should be easing into retirement and sexually harassing his nurse, not running the United States",
				"In my opinion,Donald Trump is a stupid.He has no ideas in politics",
				"@Vallmeister And that may have been the long term goal. Trump is a stupid egomaniac puppet!",
				"@GMA @KellyannePolls Trump is a stupid enough candidate to be compromised... BTW Kelly your credibility sucks.....",
				"@Scenpaii trump is a stupid. that's why people hate him lol",
				"Trump is a stupid ass https://t.co/iBpfaTzSRA",
				"@ezlusztig @jennybent Give him credit, Trump is a stupid super-magnet",
				"FASCIST TRUMP is a stupid dumbass psychopath! Fucking tweeting about bullshit &amp; having mental breakdown! #kenosha https://t.co/R8WqQ4xj5P"
			],
			"bad_words_count": 69
		}, {
			"word": "idiot",
			"texts": [
				"RT @bigkay4527: Trump is a idiot he isn't answering the questions. He goes around the questions and never gives direct answers.",
				"@Blittle_R56 @PhinsDiehard @FoxNews @MeghanMcCain so anyone that think Trump is a idiot has to go?",
				"@realDonaldTrump Trump is a idiot.",
				"@RogerJStoneJr @realDonaldTrump @RealAlexJones @infowars @PrisonPlanet Trump is a idiot mouse white DUMB !",
				"RT @karljr87: Donald trump is a idiot he is making fun of blackish, he said what if the show call whitish thats racists to him",
				"RT @bluezlimit: Donald Trump is a idiot. A damn embarrassing mess for America.",
				"@RyanACarrillo @PhilQueensNY @realDonaldTrump cuz it'sbetter to say they trump is a idiot douche bag liar and crook. Much nicer to say dummy",
				"@TheRickyDavila no president Obama showed intelligence trump is a idiot",
				"@ThereseLawren16 @realDonaldTrump I feel sorry 4 all americans. The world laughs at you...really. #Trump is a… https://t.co/7MfuocPQ2O",
				"@ItsAlexOkay_ Trump is a idiot We are all screwed",
				"RT @Christo59390079: Trump is a idiot and traitor, and does not seem to care. @realhinglec @glennbeck @jemag1 @ckkoch3",
				"Trump is a idiot and traitor, and does not seem to care. @realhinglec @glennbeck @jemag1 @ckkoch3",
				"Because Trump is a idiot ! The hepatitis is affecting his brain !!! https://t.co/Q4iRQnKDl8",
				"RT @wiljune1966: @FoxNews @foxnewspolitics @AdamShawNY Donald Trump is a Idiot. It's ok the World knows",
				"@FoxNews @foxnewspolitics @AdamShawNY Donald Trump is a Idiot. It's ok the World knows",
				"Trump is a idiot.?? “Trump and Russia say NATO is obsolete” https://t.co/uBqIYnrC6E",
				"Donald trump is A Idiot. Freedom of speech!!!",
				"@hillrod17 What do you expect Donald Trump is a idiot.",
				"@fowler2_johnm you knew better and decided against your moral compass. Trump is a idiot, I expected more from the people like yourself.",
				"RT @yankee32x: I think Donald Trump is a idiot",
				"@reaIDonaIdTfump @tonyposnanski @bandmanli Donald Trump is a Idiot. Enough said",
				"Trump is a idiot talking to idiots,he'll say anything because they'll believe anything https://t.co/8fhojLnorX",
				"Like I mean trump is a idiot, sexist , racist, disgusting human and half of America is terrible for voting for him",
				"@Chiefsfan007 @realDonaldTrump @NBCNews Sorry buddy but trump is a idiot let his cabinet lead cause he is no leader",
				"RT @si1971brown: @Nigel_Farage @realDonaldTrump Donald trump is a idiot like u fag smoking beer swilling prat u shud look closer too home.…",
				"@Nigel_Farage @realDonaldTrump Donald trump is a idiot like u fag smoking beer swilling prat u shud look closer too… https://t.co/O6kqeXFwSS",
				"@FoxNews @toddstarnes Donald Trump is a Idiot. Enough said",
				"@PoliticsNewz lol he will 4 sure Trump is a idiot moron Wannabe Dictator scum sucking bastard piece of shit @FoxNews @realDonaldTrump @MSNBC",
				"Trump is a IDIOT! Trump: Lewis should help me work on inner cities https://t.co/ACzZGQmY6o",
				"Trump is a idiot with no class @ all",
				"@MiaFarrow trump is a idiot",
				"@realDonaldTrump @OANN Judy- you look like a woman who has been disappointed by men before, so it shouldn't be a shock that Trump is a idiot",
				"Trump doesn't know the history behind john lewis, if he did he wouldn't have said that.. Lmao trump is a idiot",
				"@El__Chorro Because Trump is a idiot that doesn't know when to shut up and be Presidential",
				"Wth? Lewis is a patriot. Trump is a idiot. https://t.co/JCOmTTPzR8",
				"@ThirdCross777 @Bamanboi hillary is a war loving cunt and trump is a idiot borderline racist",
				"Failed party ?.You are a prime example of Trailer Trash Trumptard. Trump is a idiot, condescending asshole. What wi… https://t.co/QnaqBZICE8",
				"RT @TheRealDevonA: @jimsciutto @samswey @Acosta @seanspicer wow!! Trump is a idiot. And @seanspicer is a puppet and a idiot for threatening…",
				"RT @wiljune1966: @ForeignAffairs Donald Trump is a Idiot and it showing its Head",
				"@ForeignAffairs Donald Trump is a Idiot and it showing its Head",
				"@CNN WELL TRUMP IS A IDIOT! SO ANY HELP CAN HELP.. I GUESS https://t.co/UtZEs6OpRn",
				"@mskristinawong trump is a idiot",
				"I think Donald Trump is a idiot",
				"@repmarkpocan @bpshow Trump is a idiot",
				"TRUMP IS A IDIOT ...NO EXPERIENCE TO TALK NO CLASS https://t.co/SHD5oeh9DQ",
				"@cherry1776tree @jimmyfallon @FLOTUS. I'm sure he will .Trump is a idiot",
				"@OutFrontCNN @Acosta @ErinBurnett @CNN Trump is a idiot he is rude.... Has money no class just trashy He is ugly",
				"@Codi6934268 @RickysTx1 @ClassicalDemo2 @FoxNews Never trust Donald Trump is a Idiot",
				"Can we all agree that Trump is a idiot?",
				"Trump is a idiot",
				"RT @_XoxoCourt: Donald Trump is a idiot. He's really about to try and build this wall with our tax dollars then claim Mexico gonna pay us b…",
				"Donald Trump is a idiot. He's really about to try and build this wall with our tax dollars then claim Mexico gonna pay us back...",
				"@TheTodayShow Trump is a idiot dont rate him much as next president?",
				"@jimsciutto @samswey @Acosta @seanspicer wow!! Trump is a idiot. And @seanspicer is a puppet and a idiot for threatening freedom of speech",
				"RT @LML1974: Friends Donald Trump Is A Idiot Today's Press conference Horrible 4 Years of Hell Ahead Friends SMH!!!!!????",
				"@Shan3671 @VicenteFoxQue so we are going to piss off the world except for Russia, Trump is a idiot, his followers are clueless",
				"Friends Donald Trump Is A Idiot Today's Press conference Horrible 4 Years of Hell Ahead Friends SMH!!!!!????",
				"Donald trump is a idiot... that press conference was shambles. All he does is bicker... not professional at all",
				"@Zadi more ap0les,and rotten tomates Trump is a idiot,and he is going lay waste to this country",
				"@THR ROFLMAO..TRUMP IS A IDIOT WHO CNT KEEP HIS MOUTH SHUT..WHT A JOKE..",
				"RT @GlennFromMason: OMG....America elected a real live BEVERLY HILLBILLY. Donald Trump is a idiot. I'm so proud I voted for Obama.Trump is…",
				"OMG....America elected a real live BEVERLY HILLBILLY. Donald Trump is a idiot. I'm so proud I voted for Obama.Trump is a FOOL #Embarrassing",
				"trump is a idiot no tax returns no responsibilities for his outright lies we teach are children to not do everything he does he is a child",
				"@FoxNews @realDonaldTrump Who Cares. Donald Trump is a Idiot",
				"@simonhedlin @realDonaldTrump My first day here in Germany, and my German Taxi driver said Donald Trump is a idiot..how embarrassing it was",
				"@chelseahandler Trump is a idiot",
				"@realDonaldTrump @CNBC trump is a idiot",
				"@BigOMitchell @fishsports well trump is a idiot so idk why he has to stick to football",
				"@Pamela_Moore13 bc he knows trump is a idiot.",
				"@johnfugelsang Meryl Streep is very much intelligent. Trump is a idiot , ridiculous.",
				"Donald trump is a idiot he is making fun of blackish, he said what if the show call whitish thats racists to him",
				"RT @cowboyjoe458: @ResistanceParty aww to bad trump is a idiot and deserve everything he gets if not more",
				"@realDonaldTrump Donald Trump is a Idiot",
				"RT @Justmemellyxo: News from Canada: Trump is a idiot , overrated &amp; irrelevant .. Poor America ?? Meryl Streep, amazing and a inspiration ??…",
				"News from Canada: Trump is a idiot , overrated &amp; irrelevant .. Poor America ?? Meryl Streep, amazing and a inspiration ?? #SorryNotSorry ????",
				"@GeorgeTakei Trump is a IDIOT did we think he would not LIE",
				"@ResistanceParty aww to bad trump is a idiot and deserve everything he gets if not more"
			],
			"bad_words_count": 62
		}, {
			"word": "fascist",
			"texts": [
				"Left: TRUMP IS A FASCIST! Obama used drones to kill 10x more than Bush did. L: PUSSY GRABBING! Obama expanded NSA powers L: WHARGARBLE!!!!!!",
				"Trump is a Fascist, This is a Coup, I’m Not Normalizing It on Facebook https://t.co/Ol6tDXTK22",
				"Trump is a Fascist, This is a Coup, I’m Not Normalizing It on Facebook https://t.co/PQGn48BdZf",
				"Trump is a Fascist, This is a Coup, I’m Not Normalizing It on Facebook https://t.co/xxDLWAR1tJ",
				"Trump is a Fascist, This is a Coup, I’m Not Normalizing It on Facebook https://t.co/Hxy8sGPxin",
				"RT @AnonymousJobsUS: . #OPTRUMP NONE DARE CALL IT TREASON. DONALD TRUMP IS A FASCIST A... [1 of 2] #MyFirstWordsAsPresident https://t.co/BL…",
				"@mvanhulten @piersmorgan Obama has been bombing other countries nearly his whole 2 terms spreading " democracy " but Trump is a fascist? LOL",
				"@piersmorgan @realdonaldtrump WRONG! Trump is a fascist dictator who will spread havoc. #notmypresident #DeportNiggersAndFascists #AltLeft",
				"@SenSchumer @timkaine Trump is a fascist, and he's stacking his cabinet with fascist, to destroy our public institutions. #Resist #NoFascism",
				"@Akshosophy I guess they haven't noticed that Putin is a right-wing oligarch and Trump is a fascist man-on-horseback.",
				"Trump is a fascist, but let's start a war with Russia.",
				"@AlexQuinonesR2 @IamLordSav @ShaunKing A capitalist system ruled by an oligarchic elite. This is polyarchy. Trump is a fascist.",
				"RT @amozu16: @Steelpaulo Trump is a fascist",
				"RT @ryandiemon: One thing I am genuinely lost about is how people think Donald Trump is a fascist. Someone please explain",
				"@Steelpaulo Obama was an imperialist liberal, Trump is a fascist",
				"One thing I am genuinely lost about is how people think Donald Trump is a fascist. Someone please explain",
				"@Steelpaulo Trump is a fascist",
				"RT @TomLondon6: Trump is a fascist - he has no respect for democracy, rule of law or rights of minorities UK govt &amp; BBC &amp; MSM should not no…",
				". #OPTRUMP NONE DARE CALL IT TREASON. DONALD TRUMP IS A FASCIST A... [1 of 2] #MyFirstWordsAsPresident https://t.co/BLKXDoFy9h",
				"RT @CheriJacobus: Trump is a fascist. Don't say we didn't warn you. https://t.co/EZi9MLFbFv",
				"@COSTA909 So you admit that Trump is a Fascist, you just know he's a bloviating liar who is feckless and dimwitted. Got it.",
				"@markberman @ktumulty were in such deep trouble here. Trump is a fascist.",
				"@COSTA909 Whereas, Trump IS a fascist, and you supported an actual Fascist, so how you can claim to NOT support Fascism would be confusing.",
				"Trump is a fascist! #FreedomOfThePress #fascit https://t.co/ExsBEcWUsc",
				"RT @belisariusx: @Bravo6ep @willbarrett_1 first you need to prove Trump is a fascist. He isn't even in office yet. Let him start making law…",
				"@Bravo6ep @willbarrett_1 first you need to prove Trump is a fascist. He isn't even in office yet. Let him start making law. Oh, he cant.",
				"RT @SCMarshall130: I'm not a huge fan of Trump, but if you think Trump is a fascist, you're an idiot.",
				"I'm not a huge fan of Trump, but if you think Trump is a fascist, you're an idiot.",
				"trump is a fascist and democracy is dead",
				"When I say Trump is a " fascist, " I always invite those who object to define the word so we can discuss it. No one ever does. Fascinating.",
				"#Trump is a #fascist https://t.co/87NdrT9lMK",
				"@COSTA909 Trump is a fascist, you supported Trump, ergo you're a fascist.",
				"#Trump is a #Fascist https://t.co/JcIOq0FP4a",
				"@FunnyHatCool Lol well you sure as fuck ain't a patriot. And if anything Trump is a Fascist. Your echo chamber isn't too hip on the lingo",
				"Horrible goodbye from Obama today reassuring us everything will be ok.Who is he kidding.Can't he see Trump is a Fascist?Fire Comey",
				"@texascmr @kevindeplorable @FoxNews • Good people despise fascism Trump is a fascist",
				"@PoliticsVillage @sandee0802 Trump is a fascist dictator.",
				"Trump is a fascist. Don't say we didn't warn you. https://t.co/EZi9MLFbFv",
				"" By any definition trump is a fascist " They must be using urbandictionary as their reference https://t.co/vAgb5wmPbd",
				"Protest down gallery talking about Trump is a fascist. They gave out stickers and I got 4 of them in preparing to wear to work Friday",
				"RT @dashing_reaver: No popular vote, no legitimacy. Without the people's vote, Donald Trump is a fascist dictator, nothing more. #HesNotMyP…",
				"@missmayim @funnyordie LOL Obama bombed 7 countries and killed over a 1million people. Tell me again how Trump is a fascist?",
				"Anarchists: We shouldn't create positions of authoritarian rule. Citizens: OMG, Trump is a fascist dictator authoritarian! Anarchists: ...",
				"@inmatemd And yet trump is a fascist and he won.",
				"@Del_Piero_Mamba @realDonaldTrump Hypocritical to suggest what? And a) you obviously missed all righties depicting… https://t.co/vFwUNJxPgp",
				"All that " Donald trump is a fascist " handwringing worked for @DebraMessing @nbc is bringing #will&amp;grace … #fakenews https://t.co/I3orZW4WmT",
				"@SenBobCasey the truth of the matter is that donald trump is a fascist, and is doing his absolute best to fill the government with fascists",
				"Ok so #Trump is a fascist AND he's helping Russia? A country that sacrificed 10s of millions of their people to stop fascism?",
				"‘Trump is a fascist and I’m embarrassed by the Government’s response’ https://t.co/5PUKoT3ggH",
				"RT @abigailmartin74: Parading your military around is something fascists do. Trump wants to do this. Trump is a fascist.",
				"Parading your military around is something fascists do. Trump wants to do this. Trump is a fascist.",
				"Trump Says He Wanted Tillerson at the State Department All Along - The New York Times #Trump is a #Fascist #RiseUp https://t.co/BFBE42prvN",
				"@realDonaldTrump @levisteveholt yes some things on the internet and Fox news are untrue, but Trump is a fascist liar.",
				"RT @jonrosenberg: It's funny because Trump is a fascist authoritarian https://t.co/FXXQaaW89U",
				"RT @TomLondon6: Trump is a fascist - he has no respect for democracy, rule of law or rights of minorities. UK govt &amp; BBC &amp; MSM should not n…",
				"RT @PoliticalTweetW: @horseysurprise @csailors27 Are you claiming Trump is a fascist Ken M? You're not too bright being you are declared th…",
				"@horseysurprise @csailors27 Are you claiming Trump is a fascist Ken M? You're not too bright being you are declared… https://t.co/VIRELvAu4q",
				"" Trump is a FASCIST!!!" REEEEEE~ Do you even know what that means you mongoloid?!",
				"@lindagsanpedro @MalkaMelanie I just want to understand your point of view what policy's make you believe trump is a fascist ?",
				"RT @RickSmithShow: @erictheteamster @Teamsters728 @teamsters Trump is a fascist with American characteristics.",
				"@Elenwin7 @justanprankbru @AntifaDFW well heres some news 4 u then!!: trump IS a fascist!!!!! he is extreme far-right wing + promotes FACISM",
				"RT @baneofhipsters: @Bikers4Liberty It's the perfect weapon: These " disrupt " agitators will attack &amp; when they're stomped, will cry " See ? !… ",
				" Dems believe Trump is a fascist / racist ? He is a capitalist.Socialist Obama wants us to think like him & amp;
				is master of identity politics folks ",
				" RT @ afangelar_pa : ..NONE DARE CALL IT TREASON.DONALD TRUMP IS A FASCIST AND A TRAI...[1 of 2] # OpTrump # TraitorTrump https : //t.co/ykHl8…"
			],
			"bad_words_count": 53
		}, {
			"word": "corrupt",
			"texts": [
				"RT @michael_w_busch: Reminder: Trump is a corrupt omnibigoted sexual predator and liar who plans more crimes and who lost the popular vote…",
				"@LOLGOP Yeah, we're all united in thinking Trump is a corrupt orange douchenozzle.",
				"RT @abctweet100: Trump is a Corrupt Con who has succeeded bc of Souless ENABLERS #TrumpKids #GOP #TrumpFools #Republicans #Media #Law https…",
				"Retweeted Michael Busch (@michael_w_busch): Reminder: Trump is a corrupt omnibigoted sexual predator and liar... https://t.co/8Nizr7rl3L",
				"RT @WYVeteran: FASCIST TRUMP is a corrupt PIG! #kenosha #janesville #madison #milwaukee #erie https://t.co/YwXcshdCoC",
				"Reminder: Trump is a corrupt omnibigoted sexual predator and liar who plans more crimes and who lost the popular vote by &gt;2,860,000 votes.",
				"FASCIST TRUMP is a corrupt PIG! #kenosha #janesville #madison #milwaukee #erie https://t.co/YwXcshdCoC",
				"@james_black81 And yet, none in the field she's aiming for. She's just another piece of evidence that Trump is a corrupt traitor.",
				"RT @onlinePperson: @wheredabrewsat @nicktjacob trump is a corrupt Russian mafia puppet whose talents are self promotion, snake oil salesman…",
				"@TheView Trump is planning Hitler takeover Paul Ryan is evil; Comey is corrupt, anyone with Trump is a corrupt, abusive, evil idiot!",
				"Trump is a Corrupt Con who has succeeded bc of Souless ENABLERS #TrumpKids #GOP #TrumpFools #Republicans #Media #Law https://t.co/0In3Oc4CQ0",
				"@wheredabrewsat @nicktjacob trump is a corrupt Russian mafia puppet whose talents are self promotion, snake oil salesman and pussy grabbing",
				"@AdrianAmherst @FoxNews @seanhannity Couldn't care less about Clinton. Think Trump is a corrupt idiot.",
				"Reminder: Trump is a corrupt omnibigoted sexual predator and liar who plans more crimes and who lost the popular vo… https://t.co/zaBnX7mis8",
				"RT @michael_w_busch: Me: " Trump is a corrupt omnibigoted sexual predator and liar " Trump supporters: "[sexist slurs]", "[racist slurs… ",
					" @ marklevinshow Hate your show.You are a hate propagandist.Hypocrite.Trump is a corrupt crazy incompetent racist bafoon.Speak truth ",
					" Me: "Trump is a corrupt omnibigoted sexual predator and liar" Trump supporters: "[ sexist slurs ]", "[ racist slurs ]".So.Yeah.",
					" RT @ mariecasey1:  @ cmikey01 @ mmpadellan Trump is a corrupt moron, GOP will have to dump his ass sooner rather than later or go down with him.",
					" @ cmikey01 @ mmpadellan Trump is a corrupt moron, GOP will have to dump his ass sooner rather than later or go down with him.",
					" @ cnnbrk You rock!!!!We not in vain believed in you!!!You rock!!!!Trump is a corrupt bastard!The electric chair waiting for a customer!!!",
					" @ daniel17643 @ Kalnory You seriously don 't think Trump is a corrupt draft dodging puppet?",
					"Trump is a corrupt Criminal connected to the historic organised crime that has had gangsters and violent... https://t.co/FxeEmCrjRX",
					"Holy fuck, what does it take to know Trump is a corrupt flim flam man? Not like why haven' t seen him operate over t… https: //t.co/lE1Yx1yWFE",
					"Trump is a corrupt piece of shit who nominates other corrupt pieces of shit for positions in his government. https://t.co/Oa8hElEYl2",
					"@prof_gabriele I want Dems to say - trump is a corrupt fascist and resist EVERYTHING. Is that the right move to win?",
					"“Trump moves forward with a foreign deal less than a week after vowing not to” by @ngeiling https://t.co/jELryXJaow Trump is a corrupt liar",
					"@JohnRenown so you agree. Trump is a corrupt criminal ? You just didn't realize till after you voted for him?",
					"@OutLawX71 @Lordcaston @ALT_RIGHT_UK @mannyfidel Trump is a corrupt con man. America deserves far better.",
					"#Trump is a #corrupt, #minorityPresident, who's #betrayed his country. #DontheCon. https://t.co/i6t8tqSmH7 via @georgelakoff",
					"RT @larris16: Who needs evidence to understand Trump is a corrupt piss loving pig. https://t.co/tkNORqasKl",
					"@DiegoAleEsco @MMFlint Trump is not a legitimate president. Elected by Russian interference Trump is a corrupt loser - not our president!",
					"RT @Coco_Wms: Trump is a corrupt demagogue who has already used his new found political power to make money for himself /cronies. https://…",
					"Trump is a corrupt demagogue who has already used his new found political power to make money for himself /cronies. https://t.co/jPY3kjwaal",
					"Who needs evidence to understand Trump is a corrupt piss loving pig. https://t.co/tkNORqasKl",
					"RT @GailRNJD: @davidaxelrod @repjohnlewis Trump is a corrupt, vicious and despicable man. I agree w John Lewis. There's nothing to honor in…",
					"@TheRevolutionII When calling someone else dumb you should really use spell check. Trump is a corrupt liar.",
					"@Mercurian1139 @purestar777 @ltgins @realDonaldTrump Believe what? That Trump is a corrupt bully led by a brainwash… https://t.co/mC3qKAyG68",
					"@Reenhogan @kayleighmcenany @thehill I am a Rep. DT isn't. Trump is a corrupt, bought &amp; paid for Russian hack. 18 months, tops!",
					"@AdamSerwer @jbouie Trump is a corrupt bully who is unpatriotic by refusing to hive up his emoluments prohibited by the Constitution",
					"@davidaxelrod @repjohnlewis Trump is a corrupt, vicious and despicable man. I agree w John Lewis. There's nothing to honor in his election",
					"@realDonaldTrump @OANN Trump is a corrupt, lying FRAUD!! Not a legitimate President!! https://t.co/Ml3FgMhngv",
					"Yes, fight back for @repjohnlewis. But EVEN amidst that, stay focused: Trump is a corrupt, morally bankrupt puppet of Russia",
					"@Rosie Dang! How did you get so many haters on your T/L? Trump is a corrupt moron. Yes, he will be Prez, but until he proves me wrong....",
					"@SharonG99070704 @NYCMama2 Trump is a corrupt jerk who will be working with other corrupt jerks. It's not gonna go well for us."
				],
				"bad_words_count": 45
			}, {
				"word": "misogynist",
				"texts": [
					"@AboveAverageA Question: do you think Donald Trump is a misogynist or just a carefree male?",
					"RT @Thalia_Nyx: @KMontyofCal @reaIDonaIdTfump @criticalthinkrs @denisedavis1976 @TRafaelCimino @realDonaldTrump Trump is a rapist, Trump i…",
					"So much for my 5 year old daughter joining the @girlscouts. Normalizing Trump is not ok. Trump is a misogynist. #Shameful #NotMyGirlScouts",
					"@dochvactech1 @tjinaustin01 @MTV @MileyCyrus &amp; MEGYN K SAYS TRUMP IS A MISOGYNIST WHO CALLS WOMEN BIMBO ?? https://t.co/9W9Yk7hu8Y",
					"Grandma doesn't believe Trump is a misogynist Even though he's caught on tape Saying he can do anything he wants to women Lol",
					"@KMontyofCal @reaIDonaIdTfump @criticalthinkrs @denisedavis1976 @TRafaelCimino @realDonaldTrump Trump is a rapist, Trump is a misogynist",
					"@IlladelphAC @sarahmccammon Trump is a misogynist, racist, xenophobe. Didn't need a journo 2 literally tell me that when shown examples.",
					"RT @shelbyeezus: maybe if we looked past just political views and realize that trump is a misogynist racist demon and shouldn't be normaliz…",
					"maybe if we looked past just political views and realize that trump is a misogynist racist demon and shouldn't be normalized",
					"Trump sued for defamation by former Apprentice Summer Zervos: Former Apprentice contestant says Donald Trump is a " … https: //t.co/j2FaBGOFaP",
					"So y'all gone just have the lil girl scouts go to this inaug parade knowin that Trump is a misogynist AND highkey a predator? Mk",
					"Former Apprentice contestant says Donald Trump is a " misogynist " who " debased and denigrated " her. https://t.co/YuOKxifwu4",
					"Former Apprentice contestant says Donald Trump is a " misogynist " who " debased and denigrated " her.",
					"Former Apprentice contestant says Donald Trump is a “misogynist” who “debased and denigrated” her. https://t.co/O17LKhGkAE",
					"A young, dumb blonde who doesn't understand Trump is a misogynist who wld like to do ONE THING to her, so bend over if u r game, honey.",
					"@ngonimaurice No. Because she was more qualified. And Trump is a misogynist.",
					"RT @BrokenCountry1: Donald Trump is Racist! Donald Trump has tiny hands. Donald Trump is a misogynist! Here's your alternative. #HillaryCl…",
					"@TuckerCarlson your interview with @Jehmu was comical. Simple questions asking her opinion turned to race and trump is a misogynist/ racist.",
					"@fishergirlusmc Deflection! Donald Trump is a misogynist, racist, traitor . .",
					"@repmarkpocan @ShaunKing @realDonaldTrump @repjohnlewis How about instead not go because Trump is a misogynist, racist &amp; homophobe.",
					"These women saw what they wanted to see. Trump is a misogynist who brags about sexually assaulting women. That's it https://t.co/0W05ZhFHPY",
					"Donald Trump is Racist! Donald Trump has tiny hands. Donald Trump is a misogynist! Here's your alternative.… https://t.co/B12kw44CTj",
					"@atticsonline @A_J_Richards222 @hayleyyjay @shelbeeray its not like trump is a misogynist , sexist , racist piece of shit and his+",
					"@Rockettes Donald Trump is a misogynist, sexist &amp; racist. Shame on any woman supporting him.",
					"@jackieevancho Donald Trump is a misogynist &amp; sexist. I am sorry, I cannot support an artist that supports him.",
					"@Stevenwhirsch99 But Trump is a misogynist???",
					"And the world wonders why #Trump is a #misogynist... #woolf #amreading https://t.co/K5cOZWKbZH",
					"RT @WendySunshine1: @RefuseFascism @Rosie @Cookiemuffen Trump is a misogynist creep, but worse than that he is a sexual predator and pedoph…",
					"RT @cmurray862: @BlissTabitha Bill Clinton bangs interns, rapes associates and feels up anything near him and Trump is a misogynist? Elliso…",
					"@RefuseFascism @Rosie @Cookiemuffen Trump is a misogynist creep, but worse than that he is a sexual predator and pedophile. Register him.",
					"#LIberalLogic " # Trump is a misogynist!!!!" (Support Bill Clinton, Anthony Weiner, Al Gore, Cory Booker Etc) Me: https://t.co/Tww8lzabLz",
					"@BlissTabitha Bill Clinton bangs interns, rapes associates and feels up anything near him and Trump is a misogynist? Ellison is very bright!",
					"Ignore all the snowflakes who get triggered whenever you show them evidence that Trump is a misogynist #RulesforWomensMarch",
					"@WSJ Let's see: Trump is a misogynist because of womanizing, but adored Democrat champion womanizers, JFK and Bill Clinton, were not.",
					"@_Makada_ What is wrong with you? I hope this account is a joke. TRUMP is a misogynist and loves to defile women with words. YOU R A WOMAN!",
					"RT @polblonde: Trump is a misogynist who boasted about groping women. No idea if it exists, but would a tape showing him with prostitutes t…",
					"@TobyKeithMusic Please don't play at Trump's inauguration. I love your music but you are showing you dont care Trump is a misogynist",
					"Liberal logic In robotic voice Trump Is a racist Trump is a misogynist Trump Is xenophobic Repeat descriptions for any person not Liberal",
					"Donald Trump is a misogynist",
					"@CNNnewsroom @jaketapper TRUMP IS A MISOGYNIST PIG. WILL NEVER LISTEN TO EDDIE MUNSTER SPEAK ON ANYTHING!",
					"@jonathanchait I would just thank everyone who showed up. Trump is a misogynist fuck, so a women's march seams right.",
					"Trump is a misogynist who boasted about groping women. No idea if it exists, but would a tape showing him with prostitutes trouble his fans?",
					"@DennyCrane23 @megynkelly @nicolej_stjohn Trump fan who objected to megyn kelly saying Trump is a misogynist. Well done sparky",
					"Riddle me this: Trump is a misogynist but trusts the legal transfer of his business to a female lawyer? #TrumpPressConference",
					"I'm feeling this toing &amp; froing between Moscow &amp; Trump means they are bargaining. We all know Trump is a misogynist &amp; possibly perverse.",
					"#trump is a misogynist, racist &amp; all round looney so this 'compromising material' the Russkis have should provide a laugh.",
					"#trump is a misogynist, racist &amp; all round looney so this 'compromising material' the Russkis have should provide a laugh. ????????",
					"@marieosmond Marie I'm hearing both you and Donny are willing to perform at Trump's inauguration. Why? Trump is a misogynist.",
					"RT @tommycreek: So Trump is a misogynist, but jokes about anal when introducing girls aged 20, 18 &amp; 14 is appropriate..thanks Hollywood #so…"
				],
				"bad_words_count": 45
			}
		],
		"celeb_details": {
			"name": "Donald J. Trump",
			"twitter_name": "realDonaldTrump",
			"image": "http://pbs.twimg.com/profile_images/1980294624/DJT_Headshot_V2.jpg"
		},
		"mostUsedWord": "RACIST"
	}
